{"sections":{"main":{"type":"page","settings":{}},"941898c0-ed1f-4cc8-9032-310ec708a1bc":{"type":"custom-content","blocks":{"template--16634060734632__941898c0-ed1f-4cc8-9032-310ec708a1bc-text-1":{"type":"text","settings":{"title":"","subheading":"","text":"<p>Chances are you don't know exactly what ergonomics are. This article will introduce you from three aspects: what is ergonomics, ergonomics in odinlake chairs, and the importance of ergonomics.<br\/>Ergonomics is a branch of science that studies the interactions between people and the components of the systems they work on. The main goal of ergonomics is to increase the productivity of the system by providing the user with a completely comfortable and supportive environment.<br\/><br\/>Life is full of ergonomics, we just take it for granted. Ergonomics simply means that product design that conforms to the physiological structure of the human body can be said to be ergonomic. Your shoes are ergonomically designed to fit right and left. But if you wear the right shoe on your left foot, it is uncomfortable no matter how you wear it, and this design does not conform to the structure of the human foot, which is against the ergonomic design.<\/p>","od-icon":false,"html1":"","html2":"","html3":"","width":"50%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","block_custom_class":"odinlake_order_1","animations":"inherit"}},"template--16634060734632__941898c0-ed1f-4cc8-9032-310ec708a1bc-image-1":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/image_115.png","link":"","width":"50%","alignment":"center","block_custom_class":"odinlake_order_0","animations":"inherit"}},"d4044ea1-3efc-464c-8953-f23c262054fb":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/image_116_01b92889-5924-41b3-93c6-0482ec74f96b.png","link":"","width":"50%","alignment":"center","block_custom_class":"odinlake_order_2","animations":"inherit"}},"6b707f58-770f-411c-8bae-3850f6b768e7":{"type":"text","settings":{"title":"","subheading":"","text":"<p>The ergonomic chair is another result of this research, which has been used to help users focus more on their work by improving posture and reducing back and neck pain, which can lead to other ailments. Ergonomic chairs are commonly used in companies and offices where employees have to stay in the same position for long periods of time, such as doing 9-to-5 work only on a computer screen. Ergonomic chairs can also help freelancers be more productive while working from home.<\/p><p><br\/>In fact, the ergonomics of a chair is much more complicated than the simple structure of a shoe, not only to consider the human limbs, cervical spine, spine, head, but also to consider the coordination of ergonomics. For example, in terms of back ergonomics, not only the headrest and the backrest are ergonomic, but more importantly, the headrest and the backrest are combined, and the position of the headrest relative to the backrest cannot be too high, too low, too forward or backward. Otherwise it will not be very comfortable.<\/p>","od-icon":false,"html1":"","html2":"","html3":"","width":"50%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","block_custom_class":"odinlake_order_3","animations":"inherit"}}},"block_order":["template--16634060734632__941898c0-ed1f-4cc8-9032-310ec708a1bc-text-1","template--16634060734632__941898c0-ed1f-4cc8-9032-310ec708a1bc-image-1","d4044ea1-3efc-464c-8953-f23c262054fb","6b707f58-770f-411c-8bae-3850f6b768e7"],"settings":{"heading":"","heading_size":"h3","subheading":"","description":"","header_alignment":"center","container":"container-fluid","gap":30,"gap_mobile":16,"use_scroll_mobile":false,"padding_top":50,"padding_bottom":50,"custom_class":""}},"ed800015-ae9f-4399-bf0a-e0fcbae57fda":{"type":"custom-content","blocks":{"template--16634060734632__ed800015-ae9f-4399-bf0a-e0fcbae57fda-text-1":{"type":"text","settings":{"title":"<h4>Waist Ergonomics - Back Curve<\/h4>","subheading":"","text":"<p>The curve of the back is the most important point of the chair, because many people will choose the wrong chair and cause back pain or lower back pain. When a person is in an upright state, the spine is not straight, but an S-shaped curve. When you sit down, you break this balance and go from a healthy S shape to a C shape.<br\/><br\/>C-shaped back is the main cause of low back pain<br\/><br\/>· To solve low back pain, you need to keep your spine in an S shape to avoid uneven spinal force<br\/>· The seat back will share the weight of the upper part of the body, reducing the pressure on the waist and spine<br\/><br\/>You should see this prominent in the design of the ergo pro 633. Ordinary office chairs have a small waist angle, which cannot reach the curve angle of the back of the human body, and there is no support to share the weight of the upper body<\/p>","od-icon":false,"html1":"","html2":"","html3":"","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","block_custom_class":"","animations":"inherit"}},"6306dcdf-477e-4278-a461-8b7782a5781e":{"type":"text","settings":{"title":"<h4>Neck Ergonomics - Headrest<\/h4>","subheading":"","text":"<p>Although this is called a headrest, oinlake thinks it should be called a neck support, and the neck just happens to be a C-curve, which is actually a support for the neck from an ergonomic point of view.<br\/><br\/>According to scientific research, an adult's head weighs about 9 to 12 pounds. When the neck is upright, the weight of the cervical spine is still 9 to 12 pounds. The lower the head is, the greater the weight on the cervical spine will be. When it is as low as 60 degrees, the weight on the cervical spine can be as high as 54 pounds.<br\/><br\/>When bowing your head or stretching your neck forward to look at a mobile phone or computer screen, not only the pressure on the cervical spine is high, but also the surrounding muscles and soft tissues are affected, which is prone to neck and shoulder pain. Because of the unilateral stress on the cervical spine.<br\/><br\/>Head bowing and the wrong angle are the main causes of neck pain<br\/><br\/>· To solve neck pain, you need to keep your neck in a C shape to avoid uneven neck force<br\/>· Headrest will share the weight of the upper part of the head and reduce the pressure on the neck<br\/><br\/>In the design of the ergo pro 633 Headrest uses a breathable mesh with a perfect C-curve headrest.<br\/><br\/>You may have doubts that the ergo core 625 does not have this design. The 625 is more for you to develop the habit of sitting upright instead of relying too much on the chair. The 633 is designed more to keep you in the correct ergonomic sitting position<\/p>","od-icon":false,"html1":"","html2":"","html3":"","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","block_custom_class":"","animations":"inherit"}},"1651cd4d-56eb-4761-bd01-a926059a3785":{"type":"text","settings":{"title":"<h4>Arm Ergonomics - Armrests<\/h4>","subheading":"","text":"<p>The arm falls naturally and vertically under normal conditions. The height of the armrest determines the height of the shoulder. When the shoulder is kept too high or too low, it will cause the blood to not flow in the shoulder. Muscle anaerobic respiration produces lactic acid, causing shoulder pain.<br\/><br\/>Armrest height and head bow are major causes of shoulder pain<br\/><br\/>· To solve shoulder pain, let the upper arm sag naturally, and the forearm is naturally horizontal and vertical to the upper arm.<br\/>· Armrest will share the weight of the forearm and reduce the pressure on the shoulders.<br\/><br\/>Ergonomic armrests must be adjustable, odinlake chairs all support armrest height adjustment to suit the height of your arms.<\/p>","od-icon":false,"html1":"","html2":"","html3":"","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","block_custom_class":"","animations":"inherit"}},"46750caa-83ef-4689-988f-e7cdbfe26753":{"type":"text","settings":{"title":"<h4>Highly ergonomic - liftable gas lift<\/h4>","subheading":"","text":"<p>The height is a factor that affects the whole. Too high or too low will cause too much pressure on the legs, too low or too high relative to the desktop, and too high or too low line of sight. Therefore the ergonomic height must be adjustable.<br\/><br\/>Seat height is a secondary cause of hip pain<br\/><br\/>· The improvement of leg pain requires keeping the calf and thigh vertical.<br\/>· The ground bears part of the weight of the legs, reducing the pressure on the hips<br\/><br\/>odinlake chairs all support seat height adjustment to suit your height.<\/p>","od-icon":false,"html1":"","html2":"","html3":"","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","block_custom_class":"","animations":"inherit"}},"b1d849f4-cf2e-45c4-90bb-2ab70b3e89f2":{"type":"text","settings":{"title":"<h4>Hip Ergonomics - Seat Cushion<\/h4>","subheading":"","text":"<p>The forward and backward movement of the seat cushion (also called depth adjustment) affects the force area of the hips and thighs. Increasing the force area will improve the blood circulation of the buttocks in a sedentary state.<br\/><br\/>The size of the force area is the main cause of hip pain<br\/><br\/>· To solve hip pain, it is necessary to increase the force area of the buttocks<br\/>· The seat cushion fully supports the thighs and will share the weight of the legs and the body, reducing the pressure on the buttocks<br\/><br\/>The odinlake chair has a front and rear adjustable seat design on both the 633 and 643 designs. The 625 did not use this design, mainly for cost and price reasons. But this does not mean that the 625 does not pay attention to the ergonomics of the hips. We have adopted a slightly higher design in the middle to allow the thighs to carry more body weight. But this design has a disadvantage, sitting on the 625 may feel that the cushion is not wrapped enough.<br\/><br\/>Tips: If you have any questions about the design or structure of odinlake, you can always contact us, we will be more than happy to accept your opinions. This is the greatest help for us to improve and upgrade our products. If we accept your suggestion we will send you an improved chair for free.<\/p>","od-icon":false,"html1":"","html2":"","html3":"","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","block_custom_class":"","animations":"inherit"}}},"block_order":["template--16634060734632__ed800015-ae9f-4399-bf0a-e0fcbae57fda-text-1","6306dcdf-477e-4278-a461-8b7782a5781e","1651cd4d-56eb-4761-bd01-a926059a3785","46750caa-83ef-4689-988f-e7cdbfe26753","b1d849f4-cf2e-45c4-90bb-2ab70b3e89f2"],"settings":{"heading":"Ergonomics in the odinlake chair","heading_size":"h3","subheading":"","description":"","header_alignment":"left","container":"container-fluid","gap":30,"gap_mobile":16,"use_scroll_mobile":false,"padding_top":50,"padding_bottom":50,"custom_class":""}},"a96db9d1-7bb0-4ef6-83c3-0ee26de1c630":{"type":"image-with-text-2","settings":{"container":"container-fluid","hero_size":"adapt","show_overlay":false,"image":"shopify:\/\/shop_images\/image_117.png","image_link":"","parallax":false,"content_in_container":false,"content_position":"center middle","text_alignment":"center","text_size":"medium","text_color":"white","title":"","subtitle":"","text":"","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","text_alignment_mobile":"center","mb_image":"shopify:\/\/shop_images\/Group_253.png","use_content_above":false,"custom_class":"","animations":"inherit","enable_bg_zoom_effect":true}},"f283d066-0ab0-4a68-a3d7-c7557d0104b4":{"type":"custom-content","blocks":{"template--16634060734632__f283d066-0ab0-4a68-a3d7-c7557d0104b4-text-1":{"type":"text","settings":{"title":"<h4>The importance of an ergonomic chair<\/h4>","subheading":"","text":"<p>An ergonomic chair can help you avoid certain conditions, such as deep vein thrombosis, in which a clot forms in a deep vein. It occurs mainly in the lower parts of the body, such as the legs, due to immobility. Cervical spondylosis is another condition that causes inflammation of the cervical joints and discs. It usually occurs when a person is concentrating on something without tilting his neck, especially when there is no neck support.<br\/><br\/>The ergonomic seat-adjustable components help you achieve the perfect personalized posture and protect you from such diseases. When you are no longer at risk for such diseases, you are more likely to focus on your tasks. It has the power to bring out a \"productive you\" while improving your abilities. Finishing work on time and not showing symptoms of exhaustion may earn the respect of colleagues.<\/p>","od-icon":false,"html1":"","html2":"","html3":"","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","block_custom_class":"","animations":"inherit"}}},"block_order":["template--16634060734632__f283d066-0ab0-4a68-a3d7-c7557d0104b4-text-1"],"settings":{"heading":"","heading_size":"h3","subheading":"","description":"","header_alignment":"center","container":"container-fluid","gap":30,"gap_mobile":16,"use_scroll_mobile":false,"padding_top":50,"padding_bottom":50,"custom_class":""}}},"order":["main","941898c0-ed1f-4cc8-9032-310ec708a1bc","ed800015-ae9f-4399-bf0a-e0fcbae57fda","a96db9d1-7bb0-4ef6-83c3-0ee26de1c630","f283d066-0ab0-4a68-a3d7-c7557d0104b4"]}